Repository: 84000/data-translation-memory
Catalog: Toh_103-The_Teaching_by_the_Child_Inconceivable_Radiance-v2.tmx
Source language: bo
Languages: en

source: དེ་བཞིན་ཉིད་ལས་བྱུང་བ་ཡིན། །
en: They still arise from the natural state of things.

source: དེ་བཞིན་ཉིད་ནི་རྟོགས་པས་ན། །
en: Because I have realized how things truly are,

source: ང་ལ་སྐྱོན་མེད་ཡོན་ཏན་མེད། །
en: I possess neither faults nor qualities.”

source: !དེ་བཞིན་གཤེགས་པའི་མཐུ་ཡིན་ན། །བདག་གི་སྤོབས་པ་འདི་སྐྱེས་ཏེ། །
en: “Through the power of the Tathāgata, My confidence has grown,

source: འདི་འདྲའི་ལན་དག་གང་གསོལ་པ། །རྫོགས་སངས་རྒྱས་ལ་བཟོད་པར་གསོལ། །
en: And so I ask forgiveness of the perfect Buddha For all these answers I have requested.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཕྱག་གཡས་པ་གསེར་གྱི་ཁ་དོག་ཅན་ཆོས་གོས་ཀྱི་ནང་ནས་ཕྱུང་སྟེ།
en: Then, the Bhagavān drew his right hand, golden in color, from his Dharma robe and

source: ཁྱེའུ་དེའི་ལོགས་སུ་བརྐྱང་བ་དང་། དེ་ནས་ཁྱེའུ་དེས་བཅོམ་ལྡན་འདས་ཀྱི་ཕྱག་གི་སོར་མོ་ལ་བཟུང་སྟེ་ལངས་སོ། །
en: reached out toward the child, who took hold of the finger of the Bhagavān’s hand and stood up.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཁྱེའུ་དེ་ཁང་སྟོང་ནས་བསྣམས་ཏེ། སྲང་དུ་བཞག་པ་དང་།
en: The Bhagavān carried the child out of the empty house and set him down on the road.

source: དེ་ན་སྐྱེ་བོ་ཕལ་པོ་ཆེ་དག་འདི་ལྟར་ཁྱེའུ་འདི་འདི་ཁོ་ན་ལྟར་ཉོན་མོངས་པར་གྱུར་ཀྱང་། བདག་ཉིད་ཆེན་པོའི་ཆོས་འདི་ལྟ་བུའི་ལན་འདེབས་པ་ནི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ངོ་མཚར་ཏོ་སྙམ་ནསངོ་མཚར་དུ་གྱུར་ཏེ།
en: The people gathered there thought, “This child was disturbed in just this way, and yet he was able to engage in such a debate regarding the qualities of the great being. The blessed buddhas truly are remarkable!” And as it was indeed remarkable,

source: བཅོམ་ལྡན་འདས་ལ་རབ་ཏུ་ཕྱག་འཚལ་ལོ། །
en: they offered sincere homage to the Bhagavān.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཁྱེའུ་དེ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །
en: The Bhagavān then spoke the following words to the child:

source: ཁྱེའུ་ཁྱོད་ཀྱི་ལས་ཀྱི་སྒྲིབ་པ་ཟད་ཀྱིས།
en: “Child, since your obscuration of karma has been exhausted,

source: སྔོན་གྱི་དགེ་བའི་རྩ་བ་དྲན་པར་གྱིས་ལ་སྐྱེ་བོའི་ཚོགས་ཆེན་པོ་ལ་ཡང་ཤེས་པར་གྱིས་ཏེ།
en: remember your previous roots of virtue and make them known to this great crowd of people.

source: རྫུ་འཕྲུལ་གྱི་ཆོ་འཕྲུལ་ཆེན་པོ་སྟོན་ཅིག །
en: Show them a great miraculous feat!”

source: དེ་ནས་ཁྱེའུ་དེ་ས་ལས་མི་བདུན་སྲིད་ཙམ་དུ་འཕགས་ནས་ལུས་ལས་འོད་ཕྱུང་སྟེ། འོད་དེས་མཉན་ཡོད་ཐམས་ཅད་དང་། འཛམ་བུའི་གླིང་ཐམས་ཅད་སྣང་བ་ཆེན་པོ་རྒྱས་པར་གྱུར་ཏོ། །
en: The child then floated up from the ground to the height of about seven persons, and from his body streamed light, which spread until it illuminated all of Śrāvastī, and the world of Jambudvīpa in its entirety.

source: འོད་དེས་བརྒྱ་བྱིན་དང་། ཚངས་པ་དང་། འཇིག་རྟེན་སྐྱོང་བ་དང་། དེ་མ་ཡིན་པ་ལྷ་བརྒྱ་སྟོང་མང་པོ་གཞན་དག་ལ་ཡང་ཡང་དག་པར་བསྐུལ་བར་གྱུར་ནས།
en: The light drew the rapt attention of Śakra, Brahmā, the guardians of the world, and many hundreds of thousands of other gods,

source: སྐད་ཅིག་ཐང་ཅིག་ཡུད་ཙམ་དེ་ལ་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་སོང་སྟེ། ལྷགས་ནས། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ།
en: all of whom in that second, in that very moment, in that instant, went to where the Bhagavān was and bowed their heads to his feet in homage.

source: ལྷའི་མེ་ཏོག་དག་གིས་བཅོམ་ལྡན་འདས་ལ་གཏོར་ནས།
en: They tossed divine flowers to the Bhagavān and proclaimed:

source: བཅོམ་ལྡན་འདས་ཀྱེ་མ་བྱང་ཆུབ་སེམས་དཔའ་འདི་ནི་སྣང་བ་བསམ་གྱིས་མི་ཁྱབ་པ་སྟེ།
en: “O Bhagavān! This bodhisattva is inconceivably radiant

source: འདི་ལྟར་སངས་རྒྱས་ཀྱི་ཞིང་འདི་འོད་ཀྱིས་སྣང་བར་བགྱིས་ནས།
en: such that he illuminates this buddhafield with light,

source: སེམས་ཅན་དཔག་ཏུ་མ་མཆིས་པ་དག་གི་དོན་བགྱིས་སོ། །ཞེས་ཆེད་དུ་རྗོད་པ་དེ་སྐད་ཆེད་དུ་བརྗོད་དེ།
en: and so he serves the welfare of innumerable beings!”

source: དེ་ལྟར་ཁྱེའུ་དེའི་མིང་སྣང་བ་བསམ་གྱིས་མི་ཁྱབ་པ། སྣང་བ་བསམ་གྱིས་མི་ཁྱབ་པ་ཞེས་བྱ་བར་བཏགས་སོ། །
en: That is how that child came to be named Inconceivable Radiance.

source: བཅོམ་ལྡན་འདས་ཀྱིས་ཀྱང་ཁྱེའུ་འདི་སྣང་བ་བསམ་གྱིས་མི་ཁྱབ་པ་ཞེས་བྱ་བར་གྱུར་ཅིག་ཅེས། ཁྱེའུ་དེའི་མིང་ལ་རྗེས་སུ་ཡི་རང་བ་མཛད་དོ། །
en: The Bhagavān also said, “Let this child be called Inconceivable Radiance,” and so he rejoiced in that name for the child.

source: དེ་ནས་ཁྱེའུ་སྣང་བ་བསམ་གྱིས་མི་ཁྱབ་པ་བར་སྣང་དེ་ལས་བབས་ཏེ།
en: The child Inconceivable Radiance then descended from the sky and

source: ས་ལ་འདུག་པ་དང་། དེ་སངས་རྒྱས་ཀྱི་མཐུ་དང་། རང་གི་སྔོན་གྱི་དགེ་བའི་རྩ་བས་འདི་ལྟ་སྟེ་དཔེར་ན།
en: came to rest on the ground. Through the power of the Buddha and his own prior roots of virtue, what transpired next happened like this:

source: གྲོགས་པོ་ལོ་བརྒྱད་ལོན་པའི་ལུས་གཟུགས་ཡོངས་སུ་གྲུབ་པར་གྱུར་པ་དེ་འདྲ་བར་འདུག་གོ། །
en: by the time he took a seat, the child’s body had grown to that of an eight-year-old child.

source: དེ་ནས་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་གྱིས་ཁྱེའུ་དེ་ལ་ལྷའི་རས་བཅོས་བུ་ཟུང་ཅིག་བྱིན་ཏེ།
en: Then, the lord of gods Śakra presented the child with a bolt of heavenly fabric,

source: ཀྱེ་ཁྱེའུ་ང་ལ་སྙིང་བརྩེ་བའི་ཕྱིར་རས་བཅོས་བུའི་ཟུང་འདི་གྱོན་ལ་གཅེར་བུར་མ་འདུག་ཤིག །
en: saying, “Dear child, out of loving concern for me, wear this length of fabric. Don’t remain naked!”

source: དེ་ནས་ཁྱེའུ་སྣང་བ་བསམ་གྱིས་མི་ཁྱབ་པས་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །
en: The child Inconceivable Radiance then spoke these words to Śakra, the lord of gods:

source: ཀཽ་ཤི་ཀ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ནི་གོས་ཀྱི་རྒྱན་བགོས་པས་མཛེས་པ་མ་ཡིན་གྱི། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ནི་ཆོས་ཀྱི་རྒྱན་ཐོགས་ན་མཛེས་སོ། །
en: “Kauśika, it is not by wearing lovely clothes that bodhisattvas are made beautiful, but rather their beauty comes from bearing the ornaments of Dharma.

source: ཀཽ་ཤི་ཀ་དེ་ལྟ་མོད་ཀྱི་འོན་ཀྱང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་གོས་ཀྱི་རྒྱན་གང་དག་ཡིན་པ་དེ་དག་ཉོན་ཅིག །
en: Kauśika, it may be obvious, but nonetheless, let me tell you what the ornamental clothing of the bodhisattva mahāsattvas is.

source: བྱང་ཆུབ་ཀྱི་སེམས་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་གོས་ཀྱི་རྒྱན་ཏེ།
en: “The ornamental clothing of bodhisattvas is the awakening mind,

source: བྱང་ཆུབ་ཀྱི་སྙིང་པོར་བརྒྱན་པར་འགྱུར་རོ། །
en: for it adorns the seat of awakening.

source: ངོ་ཚ་ཤེས་པ་དང་ཁྲེལ་ཡོད་པའི་རྒྱན་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་གོས་ཀྱི་རྒྱན་ཏེ།
en: The ornaments of modesty and propriety are the ornamental clothing of bodhisattvas,

source: སེམས་ཅན་ཐམས་ཅད་མངོན་དུ་འཛིན་པར་འགྱུར་རོ། །
en: for they support all beings.

source: དམ་བཅས་པ་བརྟེན་པ་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་གོས་ཀྱི་རྒྱན་ཏེ།
en: “Observing their commitments is the ornamental clothing of bodhisattvas,

source: ཤེས་རབ་ཡོངས་སུ་རྫོགས་པར་འགྱུར་རོ། །
en: for it perfects their insight.

source: བསམ་པ་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་གོས་ཀྱི་རྒྱན་ཏེ།
en: Their intent is the ornamental clothing of bodhisattvas,

source: སྒྱུ་དང་གཡོ་སེལ་བར་འགྱུར་རོ། །
en: for it eliminates deceit and guile.

source: སྦྱོར་བ་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་གོས་ཀྱི་རྒྱན་ཏེ།
en: “Application is the ornamental clothing of bodhisattvas,

source: དགེ་བའི་ཆོས་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པར་འགྱུར་རོ། །
en: for it perfects all virtuous qualities.

source: ལྷག་པའི་བསམ་པ་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་གོས་ཀྱི་རྒྱན་ཏེ།
en: Superior intention is the ornamental clothing of bodhisattvas,

source: ཐམས་ཅད་ལས་ཁྱད་པར་དུ་འགྲོ་བར་འགྱུར་རོ། །
en: for it sets them apart from all others.

source: ང་རྒྱལ་མེད་པ་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་གོས་ཀྱི་རྒྱན་ཏེ།
en: “Absence of pride is the ornamental clothing of bodhisattvas,

source: ཡེ་ཤེས་ཡོངས་སུ་རྫོགས་པར་འགྱུར་རོ། །
en: for it perfects their wisdom.

source: ཆོས་དོན་དུ་གཉེར་བ་དང་། ཆོས་འདོད་པ་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་གོས་ཀྱི་རྒྱན་ཏེ།
en: Their pursuit of Dharma and longing for Dharma are the ornamental clothing of bodhisattvas,

source: སློབ་དཔོན་གྱི་དཔེ་མཁྱུད་མེད་པ་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་གོས་ཀྱི་རྒྱན་ཏེ།
en: “Their lack of parsimony as preceptors is the ornamental clothing of bodhisattvas,

source: ཆགས་པ་མེད་པའི་ཡེ་ཤེས་ཡོངས་སུ་རྫོགས་པར་འགྱུར་རོ། །
en: for it perfects their dispassionate wisdom.

source: ནོར་ཐམས་ཅད་ཡོངས་སུ་གཏོང་བ་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་གོས་ཀྱི་རྒྱན་ཏེ།
en: Their utter disregard for all wealth is the ornamental clothing of bodhisattvas,

source: མཚན་དང་དཔེ་བྱད་བཟང་པོ་ཡོངས་སུ་རྫོགས་པར་འགྱུར་རོ། །
en: for it perfects their excellent marks and signs.

source: ཚུལ་ཁྲིམས་ཡོངས་སུ་དག་པ་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་གོས་ཀྱི་རྒྱན་ཏེ།
en: “Pure discipline is the ornamental clothing of bodhisattvas,

source: སྨོན་ལམ་ཡོངས་སུ་རྫོགས་པར་འགྱུར་རོ། །
en: for it brings their aspirations to completion.

source: བཟོད་པ་དང་དེས་པ་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་གོས་ཀྱི་རྒྱན་ཏེ།
en: Acceptance and gentleness are the ornamental clothing of bodhisattvas,

source: ཚངས་པའི་དབྱངས་ཀྱི་ང་རོ་དང་སྒྲ་སྐད་ལྟ་བུའི་ཚིག་ཏུ་འགྱུར་རོ། །
en: for they become words that resound and roar like the voice of Brahmā.

source: དམ་བཅས་པ་བརྟན་ཞིང་སེམས་མི་ཞུམ་པ་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་གོས་ཀྱི་རྒྱན་ཏེ།
en: “Stable resolve and fortitude are the ornamental clothing of bodhisattvas,

source: བྱ་བ་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པར་འགྱུར་རོ། །
en: for these fulfill all their goals.

source: བསམ་གཏན་དང་། རྣམ་པར་ཐར་པ་དང་། ཏིང་ངེ་འཛིན་དང་། སྙོམས་པར་འཇུག་པ་ཐོབ་པ་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་གོས་ཀྱི་རྒྱན་ཏེ།
en: Their attainment of concentrations, liberations, absorptions, and equilibria are the ornamental clothing of bodhisattvas,

source: མངོན་པར་ཤེས་པ་ཆེན་པོའི་ཡེ་ཤེས་ཡོངས་སུ་རྫོགས་པར་འགྱུར་རོ། །
en: for these perfect the wisdom of highly advanced cognition.

source: ཚིག་རབ་ཏུ་དབྱེ་བ་ཤེས་པའི་ཤེས་རབ་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་གོས་ཀྱི་རྒྱན་ཏེ།
en: “The insight of knowing how to parse words carefully is the ornamental clothing of the bodhisattvas,

source: བག་ལ་ཉལ་བ་དང་ལྟ་བར་སྨྲ་བ་དང་། ཀུན་ནས་ལྡང་བ་ཐམས་ཅད་རྣམ་པར་སེལ་བར་འགྱུར་རོ། །
en: for it eliminates latent tendencies, beliefs, and manifest afflictions.

source: སྙིང་རྗེ་ཆེན་པོ་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་གོས་ཀྱི་རྒྱན་ཏེ།
en: Great compassion is the ornamental clothing of bodhisattvas,

source: འཁོར་བ་ན་ཡོངས་སུ་མི་སྐྱོ་བར་འགྱུར་རོ། །
en: for they never become discouraged in saṃsāra.

source: སེམས་ཅན་ཐམས་ཅད་ལ་ཞེ་འགྲས་པ་མེད་པའི་སེམས་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་གོས་ཀྱི་རྒྱན་ཏེ།
en: “Bearing no animosity toward any being is the ornamental clothing of bodhisattvas,

source: བདག་དང་གཞན་གྱི་དོན་ལ་སྐྱོ་བ་མེད་པར་འགྱུར་རོ། །
en: for they never lose interest in the welfare of self and other.

source: ཟང་ཟིང་མེད་པར་ཆོས་སྟོན་པ་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་གོས་ཀྱི་རྒྱན་ཏེ།
en: Teaching Dharma without material interest is the ornamental clothing of bodhisattvas,

source: ཤེས་རབ་ཀྱིས་བདག་དང་གཞན་སྒྲོལ་བར་འགྱུར་རོ། །
en: because insight liberates both self and other.

source: ཆོས་སྒྲུབ་པ་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་གོས་ཀྱི་རྒྱན་ཏེ།
en: “Accomplishment of Dharma is the ornamental clothing of bodhisattvas,

source: ཉོན་མོངས་པ་ཐམས་ཅད་སྤོང་བར་འགྱུར་རོ། །
en: since it removes all mental disturbances.

source: ཀཽ་ཤི་ཀ་རྣམ་གྲངས་འདིས་འདི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་གང་ཆོས་ཀྱི་རྒྱན་འདི་ལྟ་བུ་དག་དང་ལྡན་པ་དེ་ནམ་ཡང་གཅེར་བུ་མ་ཡིན་པར་རིག་པར་བྱའོ། །
en: Kauśika, in this way you must see how bodhisattvas who possess ornaments of Dharma like these are never naked.”

source: དེ་ནས་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་གྱིས་ཁྱེའུ་དེ་ལ་ཤིན་ཏུ་དགའ་བ་དང་དད་པ་སྐྱེས་ནས།
en: The lord of gods Śakra was greatly pleased with the child and trusted in him,

source: བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: and so, addressing the Bhagavān, he asked,

source: བདག་ལ་ཐུགས་བརྩེ་བའི་སླད་དུ་བཅོམ་ལྡན་འདས་ཀྱིས་རས་བཅོས་བུའི་ཟུང་འདི་ལེན་དུ་སྩལ་བར་གསོལ། །
en: “Out of loving consideration for me, would the Bhagavān please tell him to accept this length of fabric?”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཁྱེའུ་སྣང་བ་བསམ་གྱིས་མི་ཁྱབ་པ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །
en: The Bhagavān then spoke to the child Inconceivable Radiance, saying,

source: ཁྱེའུ་རས་བཅོས་བུའི་ཟུང་འདི་ལོང་ལ་གྱོན་ཅིག །
en: “Child, take this length of fabric and put it on.”

source: དེ་ནས་ཁྱེའུ་སྣང་བ་བསམ་གྱིས་མི་ཁྱབ་པ་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་དོང་སྟེ།
en: The child Inconceivable Radiance then went over to the Bhagavān,

source: པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ནས།
en: knelt with his right knee on the ground,

source: བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་དེ།
en: pressed his palms together in salutation toward him,

source: བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་རས་བཅོས་བུའི་ཟུང་བླངས་ནས་བགོས་སོ། །
en: and then, in his presence, accepted the length of fabric and put it on.

source: དེ་ནས་བཅོམ་ལྡན་འདས་གྲོང་ཁྱེར་ཆེན་པོ་མཉན་ཡོད་དུ་བསོད་སྙོམས་ལ་གཤེགས་སོ། །
en: The Bhagavān then went to receive alms in the town of Śrāvastī.

source: དེ་ན་སྐྱེས་པ་དང་། བུད་མེད་དང་། ཁྱེའུ་དང་། བུ་མོ་དང་། ཚོང་དཔོན་དང་། བྲམ་ཟེ་དང་། ཁྱིམ་བདག་དང་། རྒྱལ་པོ་དང་། བློན་པོ་ཆེན་པོ་དག་ངོ་མཚར་དུ་གྱུར་ཏེ
en: The men and women, boys and girls, merchants and brahmins, householders, and the king and his major officials were amazed and

source: ཁྱེའུ་སྣང་བ་བསམ་གྱིས་མི་ཁྱབ་པ་ལ་བལྟ་བ་དང་། བཅོམ་ལྡན་འདས་ལ་ཡང་བལྟ་བ་དང་། ཕྱག་བྱ་བ་དང་། མཆོད་པའི་ཕྱིར་འདུས་པར་གྱུར་ཏོ། །
en: assembled there to look upon the child Inconceivable Radiance, to look upon the Bhagavān, and to show them honor and homage.

source: དེ་ནས་བཅོམ་ལྡན་འདས་མཐར་གྱིས་བསོད་སྙོམས་བཞེས་ཏེ།
en: The Bhagavān accepted the offering of alms from each in turn and

source: ཁྱེའུ་སྣང་བ་བསམ་གྱིས་མི་ཁྱབ་པའི་མའི་ཁྱིམ་ག་ལ་བ་དེར་གཤེགས་སོ། །
en: then went to the home of the mother of the child Inconceivable Radiance.

source: གཤེགས་ནས་ཀྱང་ཅང་མི་གསུང་བར་ཕྱོགས་གཅིག་ཏུ་བཞུགས་སོ། །
en: When he arrived there, however, he said nothing and simply remained off to one side.

source: དེ་ནས་ཁྱེའུ་སྣང་བ་བསམ་གྱིས་མི་ཁྱབ་པའི་མ་ངོ་ཚ་ནས། བཅོམ་ལྡན་འདས་ལ་བལྟ་བའི་ཕྱིར་སྒོར་མ་བྱུང་ངོ་། །
en: Embarrassed, the mother of the child Inconceivable Radiance did not come out to the entrance to greet the Bhagavān.

source: དེ་ནས་ཁྱེའུ་སྣང་བ་བསམ་གྱིས་མི་ཁྱབ་པ་རང་གི་ཁྱིམ་དུ་སོང་ནས། མ་ལ་ཚིགས་སུ་བཅད་དེ་སྨྲས་པ།
en: The child Inconceivable Radiance went inside his home and then spoke the following verses to his mother:

source: བདག་གི་སྔོན་གྱི་ནོངས་པ་ཡིས། །ཁྱོད་ཀྱི་མངལ་དུ་བདག་མཆིས་ཏེ། །
en: “It was due to my own past misdeeds That I entered your womb,

source: ཡུམ་གྱིས་ནོངས་པ་མ་ལགས་ཀྱིས། །འོ་ལྟར་གནོད་པར་མ་མཛད་ཅིག །
en: Not because of any fault of yours, mother; That being so, don’t feel ashamed!

source: ཐུགས་བརྩེ་ལྡན་ཏེ་བསྐྱེད་པས་ན། །
en: “Since you created me with love,

source: བདག་གི་སྦྱིན་གནས་ཁྱོད་ལགས་སོ། །
en: I am the one indebted to you.

source: ཞལ་ཚ་མ་མཛད་མ་འཛེམ་པར། །དེ་བཞིན་གཤེགས་པའི་དྲུང་དུ་བཞུད། །
en: Don’t be embarrassed or shy away. Come before the Tathāgata!

source: དེ་ལྟར་ཁྱོད་མངལ་བདག་མཆིས་པ། །ཁྱོད་ཀྱིས་བརྙེས་པ་ལེགས་པར་བརྙེས། །
en: “My entry into your womb Was an endowment you received well.

source: ལུས་ཀྱི་དགེ་བའི་ལས་རྣམས་ཀྱང་། །རྣམ་པར་འདྲེན་ལ་ཞུ་བ་མཛོད། །
en: Come share with the Great Guide as well The virtuous deeds of your body!”

source: དེ་ནས་ཁྱེའུ་སྣང་བ་བསམ་གྱིས་མི་ཁྱབ་པས། ལྷའི་དབང་པོ་བརྒྱ་བྱིན་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །
en: The child Inconceivable Radiance then spoke to the lord of gods Śakra, saying,

source: ཀཽ་ཤི་ཀ་ལྷའི་མེ་ཏོག་མན་དཱ་ར་བ་དག་དང་། ལྷའི་སྤོས་དག་དང་། ལྷའི་གོས་དག་བདག་ལ་སྩོལ་ཅིག །
en: “Kauśika, give me some heavenly mandārava flowers, divine incense, and godly raiment.

source: དེ་དག་བདག་གི་སྐྱེད་པའི་མ་འདི་ལ་སྩལ་ཏོ། །
en: I shall give them to this mother who gave birth to me.

source: འདིས་དེ་དག་གིས་བཅོམ་ལྡན་འདས་ལ་མཆོད་པ་བགྱིས་ནས།
en: By presenting them as a gift to the Bhagavān,

source: བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་སྐྱེད་པར་འགྱུར་རོ། །
en: she will generate the mind set on unsurpassed and perfect awakening.”

source: དེ་ནས་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་གྱིས། ཁྱེའུ་དེ་ལ་ལྷའི་མེ་ཏོག་མན་དཱ་ར་བ་དག་དང་། ལྷའི་སྤོས་དག་དང་། ལྷའི་གོས་དག་བྱིན་ནོ། །
en: And so the lord of gods Śakra gave the child heavenly mandārava flowers, divine incense, and godly raiment.

source: དེ་ནས་ཁྱེའུ་སྣང་བ་བསམ་གྱིས་མི་ཁྱབ་པས་མ་ལ་ཚིགས་སུ་བཅད་དེ་སྨྲས་པ།
en: The child Inconceivable Radiance then spoke the following verses to his mother:

source: ཡུམ་ཅིག་ལྷ་ཡི་མེ་ཏོག་མན་དཱ་ར། །བལྟ་སྡུག་མཛེས་ཤིང་ཡིད་དུ་འོང་བ་དང་། །
en: “Mother, take these heavenly mandārava flowers, So lovely to behold and enjoyable,

source: སྤོས་དང་ན་བཟའ་འདི་དག་བླང་མཛོད་ལ། །མི་མཆོག་སངས་རྒྱས་དེ་ལ་དབུལ་བ་མཛོད། །
en: Along with this incense and clothing, And offer them to this great man, the Buddha.

source: འཇིག་རྟེན་དག་ན་ཕ་མ་ཟས་སྐོམ་དང་། །ནོར་དང་གོས་ཀྱིས་མཆོད་པ་མཆོད་མ་ལགས། །
en: “Gifts made in this world to one’s parents, such as food and drink, Money and clothes, are not offerings at all

source: གཞན་དུ་གང་དག་ཆོས་ལ་སྦྱོར་བགྱིད་པ། །དེས་ན་དེ་དག་མཆོད་པ་བགྱིས་པར་འགྱུར། །
en: Compared with what connects them to Dharma; Therefore, make an offering of these items!

source: རྐང་གཉིས་དམ་པ་དེ་ལ་མཆོད་མཛོད་ལ། །
en: “Make an offering to this holiest of humans,

source: བྱང་ཆུབ་མཆོག་ཏུ་སྨོན་ལམ་བརྟན་པར་མཛོད། །
en: And firmly aspire to supreme awakening.

source: བདག་ནི་དུས་དུས་ཁྱོད་ཀྱི་དྲུང་མཆིས་ཏེ། །
en: Time and again, I have been at your side;

source: ཡུན་རིང་དུས་ནས་སྐུལ་བ་བགྱིད་པ་ལགས། །
en: For so very long have I encouraged you!

source: གནོང་ཞིང་ཞུམ་པའི་སེམས་སུ་མ་མཛད་པར། །
en: “Without feeling unworthy or ashamed,

source: རངས་པའི་སེམས་དང་དགའ་བ་ཐོབ་མཛོད་ལ། །
en: But with a renewed sense of joy and delight,

source: རང་བྱུང་རྒྱལ་བ་བཞུགས་པ་དེར་བཞུད་དེ། །
en: Proceed to where the genuine Victor awaits,

source: སྐྱེས་བུ་མཆོག་གི་ཞབས་ལ་ཕྱག་མཛོད་ལ། །
en: And offer homage at the feet of this supreme being!

source: མགོན་པོ་དེ་ལ་མེ་ཏོག་སྤོས་རྣམས་དང་། །
en: “Handing flowers over to the Lord,

source: དེ་བཞིན་ན་བཟའ་རྣམས་ཀྱང་གཏོར་ནས་སུ། །རྒྱལ་བ་དེ་ལས་དགེ་བའི་རྩ་བསྐྱེད་དེ། །
en: Along with incense and clothing, Generate the roots of virtue from that Victor,

source: བྱང་ཆུབ་མཆོག་ཏུ་སེམས་ཀྱང་བསྐྱེད་པ་མཛོད། །
en: And generate too the resolve for supreme awakening!

source: བྱང་ཆུབ་མཆོག་ཏུ་སེམས་ནི་བརྟན་གྱུར་ནས། །
en: “Having set your resolve for supreme awakening,

source: གང་དག་དད་པས་རྒྱལ་ལ་གུས་བགྱིས་པ། །
en: Then, as is said, ‘the Lord of the World assures full maturation

source: དེ་དག་རྣམ་སྨིན་འཇིག་མགོན་བཀའ་སྩལ་ཅེས། །རང་བྱུང་རྒྱལ་བ་དེ་ལ་ཞུ་བ་མཛོད། །
en: To those who, with faith, pay respect to a Victor.’Go petition this genuine Victor!”

source: དེ་ནས་བུད་མེད་དེས་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ།
en: The woman then went over to the Bhagavān and offered homage by prostrating to his feet,

source: བཅོམ་ལྡན་འདས་ལ་མཆོད་པ་བྱས་ནས། ཞུ་བ་ཇི་སྐད་བསྟན་པ་བཞིན་དུ་གུས་པ་དང་བཅས་པར་ཡོངས་སུ་ཞུས་སོ། །
en: made offerings to him, and put her request to him fully and respectfully,

source: ཞུ་བ་ཞུས་པ་དང་།
en: just as she had been instructed. After she had made this request,

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: the Bhagavān told her,

source: དགེ་བའི་རྩ་བ་བསྒྲུབས་པ་འདིས། །ངན་འགྲོའམ་མི་ཁོམ་འགྲོ་མི་འགྱུར། །
en: “Through this accomplishment of roots of virtue you shall not go to the lower realms or an unfortunate state.

source: སངས་རྒྱས་བྱེ་མང་མཉེས་བྱས་ནས། །མི་ཡི་དམ་པ་སངས་རྒྱས་འགྱུར། །
en: Having pleased millions upon millions of buddhas, you shall yourself become a buddha, the holiest of persons.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་གྲོང་ཁྱེར་ཆེན་པོ་མཉན་ཡོད་དུ་བསོད་སྙོམས་བཞེས་ནས།
en: When he had finished receiving alms in the town of Śrāvastī,

source: ཁྱེའུ་སྣང་བ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་། སྐྱེ་བོ་ཕལ་པོ་ཆེ་གཞན་དག་དང་ཡང་ཐབས་ཅིག་ཏུ་གྲོང་ཁྱེར་ནས་བྱུང་སྟེ།
en: the Bhagavān, accompanied by the child Inconceivable Radiance and other lay people,

source: རྒྱལ་བུ་རྒྱལ་བྱེད་ཀྱི་ཚལ་མགོན་མེད་ཟས་སྦྱིན་གྱི་ཀུན་དགའ་ར་བ་ག་ལ་བ་དེར་གཤེགས་སོ། །
en: left the town and returned to the Jeta Grove in Anāthapiṇḍada’s park.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཟས་ཀྱི་བྱ་བ་མཛད་དེ།
en: The Bhagavān then took his meal,

source: ནང་དུ་ཡང་དག་འཇོག་ལས་བཞེངས་ནས་ཆོས་ཉན་དུ་གཞུག་པའི་ཕྱིར་བཞུགས་སོ། །
en: arose from his inner absorption, and readied himself to make the Dharma heard.

source: དེ་ནས་ཡུལ་ཀོ་ས་ལའི་རྒྱལ་པོ་གསལ་རྒྱལ་དཔུང་གི་ཚོགས་ཡན་ལག་བཞི་པ་དང་ལྷན་ཅིག་ཏུ་རྒྱལ་བུ་རྒྱལ་བྱེད་ཀྱི་ཚལ་ག་ལ་བ་དང་། བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས།
en: The king of the state of Kośala, Prasenajit, accompanied by his four military regiments, came to see the Bhagavān in Anāthapiṇḍada’s park. As he and his men arrived,

source: བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ།
en: they offered homage by prostrating to the Bhagavān’s feet and

source: ཕྱོགས་གཅིག་ཏུ་འདུག་གོ། །
en: then sat off to one side.

source: ཕྱོགས་གཅིག་ཏུ་འདུག་ནས།
en: Once they were seated at his side,

source: ཡུལ་ཀོ་ས་ལའི་རྒྱལ་པོ་གསལ་རྒྱལ་གྱིས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: the king of the state of Kośala, Prasenajit, said to the Bhagavān, “Bhagavān,

source: བཅོམ་ལྡན་འདས་གང་ངོ་མཚར་རྨད་དུ་བྱུང་བའི་ཆོས་རྣམ་པ་དེ་ལྟ་བུ་དག་དང་ལྡན་པའི་ཁྱེའུ་སྣང་བ་བསམ་གྱིས་མི་ཁྱབ་པ་དེ་ག་ལ་མཆིས།
en: where is the child Inconceivable Radiance, who possesses such wondrous and amazing qualities?”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཁྱེའུ་སྣང་བ་བསམ་གྱིས་མི་ཁྱབ་པ་བསྟན་ནས་མཐོང་སྟེ།
en: The Bhagavān then pointed out the child Inconceivable Radiance,

source: རྒྱལ་པོ་གསལ་རྒྱལ་གྱིས་ཁྱེའུ་དེའི་ལུས་གཟུགས་ཡོངས་སུ་གྲུབ་པ་ལྷ་ལས་འདས་པའི་མདོག་དང་།
en: and King Prasenajit could see at first sight that the child’s physical body was fully developed, with a complexion superior to that of the gods, and

source: མི་འཇིགས་པ་དང་། ཚུལ་ཁྲིམས་དང་། ཏིང་ངེ་འཛིན་དང་། ཤེས་རབ་ཀྱིས་བརྒྱན་པ་མཐོང་ནས་
en: that he was graced with fearlessness, disciplined conduct, absorption, and insight.

source: འདི་སྙམ་དུ་སེམས་ཏེ།
en: The king therefore thought to himself,

source: སྔོན་ལས་བྱས་ཤིང་བསགས་པ་ཇི་ལྟ་བུ་ཞིག་གིས་འདི་ལྟར་འདིའི་ལུས་ཡོངས་སུ་དག་པར་གྱུར་སྙམ་མོ། །
en: “Imagine what kinds of deeds he must have performed and accumulated in the past to have a pure body like that!”

source: དེ་ནས་ཁྱེའུ་སྣང་བ་བསམ་གྱིས་མི་ཁྱབ་པས་སངས་རྒྱས་ཀྱི་མཐུ་དང་། རང་གི་སྔོན་གྱི་དགེ་བའི་རྩ་བས་རྒྱལ་པོ་གསལ་རྒྱལ་གྱི་སེམས་ཀྱི་ཡོངས་སུ་རྟོགས་པ་སེམས་ཀྱིས་ཤེས་ནས་
en: The child Inconceivable Radiance, due to the power of the Buddha and because of his own past roots of virtue, knew in his mind what King Prasenajit had thought.

source: ཚིགས་སུ་བཅད་དེ་སྨྲས་པ།
en: So he said:

source: གང་དག་རྟག་ཏུ་བྱམས་སེམས་དག་སེམས་ལྡན། །
en: “Those who consistently possess a loving and pure mind,

source: གང་དག་མི་བརླང་མཉེན་ཞིང་དྲན་ལྡན་ལ། །
en: Are not fractious, but gentle and thoughtful,

source: ལེགས་པར་བསྡམས་ཤིང་དྲང་ལ་ཚངས་སྤྱོད་པ། །
en: As well as well-mannered, honest, and chaste—

source: དེ་དག་ལུས་ནི་རྣམ་པར་དག་པར་འགྱུར། །
en: It is they who become pure in body.

source: གང་དག་སྡིག་པ་སྤོང་ཞིང་མི་སྤྱོད་ལ། །
en: “Those who abandon and abstain from wrong actions,

source: རྟག་ཏུ་དགེ་བ་མི་ཆུང་རྣམ་སྤེལ་ཞིང་། །
en: Who never devalue but increase virtue,

source: གནོད་པར་སེམས་དང་ཁྲོ་བ་རྣམ་སྤོང་བ། །དེ་དག་ལུས་ནི་རྣམ་པར་དག་པར་འགྱུར། །
en: Who entirely reject malice and hostility— It is they who become pure in body.

source: གང་དག་སངས་རྒྱས་ཆོས་དང་ཚོགས་མཆོག་ལ། །གུས་དང་བཅས་པར་རྟག་ཏུ་མཆོད་བྱེད་ཅིང་། །
en: “Those who continually and respectfully make offerings To the Buddha, the Dharma, and the Saṅgha

source: གཞན་ལ་རྡེག་འདོད་སྡིགས་མོ་མི་བྱེད་པ། །དེ་དག་ལུས་ནི་རྣམ་པར་དག་པར་འགྱུར། །
en: And don’t feel aggression toward or threaten others—It is they who become pure in body.

source: གང་དག་གཞན་ལ་ཕྲག་དོག་སེར་སྣ་དང་། །དེ་བཞིན་ང་རྒྱལ་དག་ཀྱང་མི་བྱེད་ལ། །
en: “Those who are not jealous, Miserly, or otherwise prideful toward others

source: གཞན་གྱི་ཉེས་པ་བྱུང་བ་མི་རྗོད་པ། །དེ་དག་ལུས་ནི་རྣམ་པར་དག་པར་འགྱུར། །
en: And say nothing when others’ faults arise—It is they who become pure in body.

source: གཞན་ལ་ཅོ་དྲི་བ་དང་སྨད་པ་དང་། །བཤུང་བ་དག་ནི་ནམ་ཡང་མི་བྱེད་ཅིང་། །
en: “Those who never look to blame, Reproach, or rebuke others

source: གཞན་ལ་འཁྲུལ་པའི་གླགས་ལྟ་མི་བྱེད་པ། །དེ་དག་ལུས་ནི་རྣམ་པར་དག་པར་འགྱུར། །
en: Or look for a chance to exploit them—It is they who become pure in body.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལ་རྒྱལ་པོ་གསལ་རྒྱལ་གྱིས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: King Prasenajit then said to the Bhagavān,

source: བཅོམ་ལྡན་འདས་ཁྱེའུ་སྣང་བ་བསམ་གྱིས་མི་ཁྱབ་པ་འདི་ཆོས་ཆེན་པོ་དང་ལྡན་པ་ལགས་ན།
en: “Bhagavān, since this child Inconceivable Radiance clearly possesses such great qualities,
